(defparameter *rgb*
    #2A( ((255   0   0)   (  0 255   0)   (  0   0 255)   (255 255   0)   (255   0 255)   (  0 255 255)   (128 128 128)   ( 64  64  64)   (200  50  50)   ( 50 200  50)   ( 50  50 200)   (150 150  30)   ( 20  20  20)   (220 180  40)   ( 90  60 200)   ( 10 200 150)   (255 100   0)   (  0 100 255)   (100 255 100)   (100   0 100)   (100 100   0)   (  0 100 100)   (200 100 100))
         ((100 200 100)   (100 100 200)   (150  75  75)   ( 75 150  75)   ( 75  75 150)   (180 180 100)   ( 40  80 120)   (120  40  80)   ( 80 120  40)   (200 150 100)   (100 200 150)   (150 100 200)   (200 150 200)   (150 200 150)   ( 50 100 150)   (150  50 100)   (100 150  50)   (255 150   0)   (  0 150 255)   (150 255   0)   (  0 255 150)   (150   0 255)   (255 150 150))
         ((150 255 150)   (150 150 255)   (200 200 200)   (100 100 100)   ( 50  50  50)   (240 120  80)   ( 80 240 120)   (120  80 240)   (180 200  80)   ( 80 180 200)   (200  80 180)   (160 100 140)   (140 160 100)   (100 140 160)   (220  80  60)   ( 60 220  80)   ( 80  60 220)   (255 200  50)   ( 50 255 200)   (200  50 255)   (120 180 220)   (220 120 180)   (180 220 120))
         (( 90 140 110)   (110  90 140)   (140 110  90)   (200 170 130)   (130 200 170)   (170 130 200)   (255 180  80)   ( 80 255 180)   (180  80 255)   (160 200 140)   (140 160 200)   (200 140 160)   ( 70 190 160)   (160  70 190)   (190 160  70)   (210 150 120)   (120 210 150)   (150 120 210)   (180 100  80)   ( 80 180 100)   (100  80 180)   (230 130 100)   (100 230 130))
         ((130 100 230)   (140 190 170)   (170 140 190)   (190 170 140)   (110 160 130)   (130 110 160)   (160 130 110)   (250 170  90)   ( 90 250 170)   (170  90 250)   (190 120 150)   (150 190 120)   (120 150 190)   (200  90 110)   (110 200  90)   ( 90 110 200)   (170 210 130)   (130 170 210)   (210 130 170)   (120 140 180)   (180 120 140)   (140 180 120)   (240 160 110))
         ((110 240 160)   (160 110 240)   (150 180 200)   (200 150 180)   (180 200 150)   (130 160 190)   (190 130 160)   (160 190 130)   (180 140 160)   (160 180 140)   (140 160 180)   (210 180 150)   (150 210 180)   (180 150 210)   (100 120 140)   (140 100 120)   (120 140 100)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160))
         ((190 170 150)   (150 190 170)   (170 150 190)   (130 150 170)   (170 130 150)   (150 170 130)   (200 160 140)   (140 200 160)   (160 140 200)   (180 190 200)   (200 180 190)   (190 200 180)   (140 130 150)   (150 140 130)   (130 150 140)   (170 160 150)   (150 170 160)   (160 150 170)   (190 180 170)   (170 190 180)   (180 170 190)   (120 110 100)   (100 120 110))
         ((110 100 120)   (210 190 170)   (170 210 190)   (190 170 210)   (160 150 140)   (140 160 150)   (150 140 160)   (180 170 160)   (160 180 170)   (170 160 180)   (200 190 180)   (180 200 190)   (190 180 200)   (130 120 110)   (110 130 120)   (120 110 130)   (220 200 190)   (190 220 200)   (200 190 220)   (170 160 150)   (150 170 160)   (160 150 170)   (190 180 170))
         ((170 190 180)   (180 170 190)   (210 200 190)   (190 210 200)   (200 190 210)   (140 130 120)   (120 140 130)   (130 120 140)   (230 210 200)   (200 230 210)   (210 200 230)   (180 170 160)   (160 180 170)   (170 160 180)   (200 190 180)   (180 200 190)   (190 180 200)   (220 210 200)   (200 220 210)   (210 200 220)   (150 140 130)   (130 150 140)   (140 130 150))
         ((240 220 210)   (210 240 220)   (220 210 240)   (190 180 170)   (170 190 180)   (180 170 190)   (210 200 190)   (190 210 200)   (200 190 210)   (230 220 210)   (210 230 220)   (220 210 230)   (160 150 140)   (140 160 150)   (150 140 160)   (250 230 220)   (220 250 230)   (230 220 250)   (200 190 180)   (180 200 190)   (190 180 200)   (220 210 200)   (200 220 210))
         ((210 200 220)   (230 220 210)   (210 230 220)   (220 210 230)   (170 160 150)   (150 170 160)   (160 150 170)   (240 230 220)   (220 240 230)   (230 220 240)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200))
         ((200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240))
         ((180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160))
         ((160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80))
         (( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120))
         ((200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180))
         ((180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100))
         ((100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140))
         ((220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200))
         ((200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120))
         ((120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160))
         ((240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220))
         ((220 200 240)   (180 160 140)   (140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140))
         ((140 180 160)   (160 140 180)   (120 100  80)   ( 80 120 100)   (100  80 120)   (200 180 160)   (160 200 180)   (180 160 200)   (140 120 100)   (100 140 120)   (120 100 140)   (220 200 180)   (180 220 200)   (200 180 220)   (160 140 120)   (120 160 140)   (140 120 160)   (240 220 200)   (200 240 220)   (220 200 240)   (180 160 140)   (140 180 160)   (160 140 180))
        ))


(defparameter *q-table*
  #2A((16 11 10 16 24 40 51 61)
      (12 12 14 19 26 58 60 55)
      (14 13 16 24 40 57 69 56)
      (14 17 22 29 51 87 80 62)
      (18 22 37 56 68 109 103 77)
      (24 35 55 64 81 104 113 92)
      (49 64 78 87 103 121 120 101)
      (72 92 95 98 112 100 103 99)))


(defun rgb-to-ycbcr (rgb-array)
  (let* ((height (array-dimension rgb-array 0)) 
        (width (array-dimension rgb-array 1))
        (Y (make-array (list height width)))
        (Cb (make-array (list height width)))
        (Cr (make-array (list height width))))
      (dotimes (i height)
        (dotimes (j width)
          (destructuring-bind (r g b) (aref rgb-array i j)
            (setf (aref Y i j) (round (+ (* 0.299 r) (* 0.587 g) (* 0.114 b))))
            (setf (aref Cb i j) (round (- (+ 128 (* 0.5 b)) (* 0.168736 r) (* 0.331264 g))))
            (setf (aref Cr i j) (round (- (+ 128 (* 0.5 r)) (* 0.418688 g) (* 0.081312 b)))))))
    (values Y Cb Cr)))

(defun padding (matrix)
  (let* ((old-h (array-dimension matrix 0))
         (old-w (array-dimension matrix 1))
         (new-h (* 8 (ceiling old-h 8)))
         (new-w (* 8 (ceiling old-w 8)))
         (new-matrix (make-array (list new-h new-w))))
    (dotimes (i new-h)
      (dotimes (j new-w)
        (let ((source-i i)
              (source-j j))
          (when (>= i old-h)
              (setf source-i (- old-h 1)))
          (when (>= j old-w)
              (setf source-j (- old-w 1)))
          (setf (aref new-matrix i j)
                (aref matrix source-i source-j)))))
    
    new-matrix))

(defun subsample (component)
    (let* ((height (array-dimension component 0))
        (width (array-dimension component 1))
        (new-h (ceiling height 2))
        (new-w (ceiling width 2))
        (out (make-array (list new-h new-w))))    
        (dotimes (i new-h)
          (dotimes (j new-w)
            (let ((sum 0)
              (count 0))
              (dotimes (di 2)
                (dotimes (dj 2)
                  (let ((old-i (+ (* 2 i) di))
                        (old-j (+ (* 2 j) dj)))
                  (when (and (< old-i height) (< old-j width))
                    (incf sum (aref component old-i old-j))
                    (incf count)))))
            (setf (aref out i j)
                  (round (/ sum count))))))
    out))

(defun split-blocks (matrix)
  (let* ((h (array-dimension matrix 0))
         (w (array-dimension matrix 1))
         (blocks '()))
    (dotimes (i (/ h 8))
      (dotimes (j (/ w 8))
        (let ((block (make-array '(8 8))))
          (dotimes (bi 8)
            (dotimes (bj 8)
              (setf (aref block bi bj)
                    (aref matrix (+ (* i 8) bi)
                                 (+ (* j 8) bj)))))
          (push block blocks))))
    (reverse blocks)))

(defun dct (block)
  (let ((shifted-block (shift-block block))
        (result (make-array '(8 8))))
    (dotimes (u 8)
      (dotimes (v 8)
        (let ((sum 0))
          (dotimes (x 8)
            (dotimes (y 8)
              (incf sum
                    (* (aref shifted-block x y)
                       (cos (/ (* (+ (* 2 x) 1) u pi) 16))
                       (cos (/ (* (+ (* 2 y) 1) v pi) 16))))))
          (let* ((au (if (= u 0) (/ 1 (sqrt 2)) 1))
                 (av (if (= v 0) (/ 1 (sqrt 2)) 1))
                 (coeff (* 0.25 au av sum)))
            (setf (aref result u v) coeff)))))
    result))

(defun shift-block (block)
  (let ((out (make-array '(8 8))))
    (dotimes (i 8)
      (dotimes (j 8)
        (setf (aref out i j)
              (- (aref block i j) 128))))
    out))

(defun quantize-block (dct-block q-table)
  (let ((out (make-array '(8 8))))
    (dotimes (i 8)
      (dotimes (j 8)
        (setf (aref out i j)
              (round (/ (aref dct-block i j)
                        (aref q-table i j))))))
    out))

(defun zigzag-scan (block)
  (let* ((zigzag-order
           #(
             (0 0) (0 1) (1 0) (2 0) (1 1) (0 2) (0 3) (1 2)
             (2 1) (3 0) (4 0) (3 1) (2 2) (1 3) (0 4) (0 5)
             (1 4) (2 3) (3 2) (4 1) (5 0) (6 0) (5 1) (4 2)
             (3 3) (2 4) (1 5) (0 6) (0 7) (1 6) (2 5) (3 4)
             (4 3) (5 2) (6 1) (7 0) (7 1) (6 2) (5 3) (4 4)
             (3 5) (2 6) (1 7) (2 7) (3 6) (4 5) (5 4) (6 3)
             (7 2) (7 3) (6 4) (5 5) (4 6) (3 7) (4 7) (5 6)
             (6 5) (7 4) (7 5) (6 6) (5 7) (6 7) (7 6) (7 7)
            ))
         (result (make-array 64)))
    (dotimes (i 64)
      (let ((pos (aref zigzag-order i)))
        (setf (aref result i)
              (aref block (first pos) (second pos)))))
    result))


(defun jpeg-run (rgb)
  (multiple-value-bind (Y Cb Cr) 
      (rgb-to-ycbcr rgb)

    ;; Преобразование цветового пространства
    (format t "~%Преобразование в Y:")
    (print Y)
    (format t "~%Преобразование в Cb:")
    (print Cb)
    (format t "~%Преобразование в Cr:")
    (print Cr)

    ;; Субдискретизация цветности
    (let ((Cb-sub (subsample Cb))
          (Cr-sub (subsample Cr)))
      (format t "~%Субдискретизация Cb:")
      (print Cb-sub)
      (format t "~%Субдискретизация Cr:")
      (print Cr-sub)

      ;; Дополнение
      (let* ((Y-pad  (padding Y))
             (Cb-pad (padding Cb-sub))
             (Cr-pad (padding Cr-sub)))

        (format t "~%Дополненная Y:")
        (print Y-pad)
        (format t "~%Дополненная Cb:")
        (print Cb-pad)
        (format t "~%Дополненная Cr:")
        (print Cr-pad)

        ;; Разбиение на блоки
        (let* ((Y-blocks  (split-blocks Y-pad))
               (Cb-blocks (split-blocks Cb-pad))
               (Cr-blocks (split-blocks Cr-pad)))

          (format t "~%Блоки Y:")
          (print Y-blocks)
          (format t "~%Блоки Cb:")
          (print Cb-blocks)
          (format t "~%Блоки Cr:")
          (print Cr-blocks)

          ; ДКП + квантование + зигзаг
          (let ((Y-final  '())
                (Cb-final '())
                (Cr-final '()))

            (dolist (b Y-blocks)
              (push (zigzag-scan (quantize-block (dct b) *q-table*))
                    Y-final))

            (dolist (b Cb-blocks)
              (push (zigzag-scan (quantize-block (dct b) *q-table*))
                    Cb-final))

            (dolist (b Cr-blocks)
              (push (zigzag-scan (quantize-block (dct b) *q-table*))
                    Cr-final))

            (setf Y-final (reverse Y-final)
                  Cb-final (reverse Cb-final)
                  Cr-final (reverse Cr-final))

            (format t "~%~%Блоки после ДКП + квантование + зигзаг~%")

            (format t "~%Y (zig-zag):")
            (print Y-final)

            (format t "~%Cb (zig-zag):")
            (print Cb-final)

            (format t "~%Cr (zig-zag):")
            (print Cr-final)

            ))))))

(jpeg-run *rgb*)

;; ТЕСТЫ

(defun assert-equal (test-name actual expected)
  (if (equalp actual expected)
      (format t "[OK] ~A~%" test-name)
      (format t "[FAIL] ~A~%  Expected: ~A~%  Actual:   ~A~%" 
              test-name expected actual)))

(defun run-tests ()
  (format t "~%--- ЗАПУСК ТЕСТОВ ---~%~%")

  ;; 1. Тест конвертации RGB to YCbCr
  (multiple-value-bind (y cb cr) 
      (rgb-to-ycbcr #2A(((123 200 98))))
    (assert-equal "RGB to YCbCr (Y)" y  #2A((165)))
    (assert-equal "RGB to YCbCr (Cb)" cb #2A((90)))
    (assert-equal "RGB to YCbCr (Cr)" cr #2A((98))))

    ;; 2. Тест Дополнение
    (let ((input #2A((1 2) 
                   (3 4)))
        (expected (make-array '(8 8) :initial-element 4)))
    (setf (aref expected 0 0) 1)
    (setf (aref expected 0 1) 2)
    (setf (aref expected 1 0) 3)
    (setf (aref expected 1 1) 4)
    (loop for j from 2 below 8 do (setf (aref expected 0 j) 2))
    (loop for j from 2 below 8 do (setf (aref expected 1 j) 4))
    (loop for i from 2 below 8 do (setf (aref expected i 0) 3))
    (assert-equal "Padding" (padding input) expected))

    ;; 3. Тест Субдискретизация
  (let ((input #2A((10 10 20 40)
                   (10 10 20 40)
                   (100 200 0 0)
                   (100 200 0 0)))
        (expected #2A((10 30)
                      (150 0))))
    (assert-equal "Subsample" (subsample input) expected))

  ;; 4. Тест ДКП
 (let ((flat-block (make-array '(8 8) :initial-element 128))
        (expected-zeros (make-array '(8 8) :initial-element 0)))
    (assert-equal "DCT" (dct flat-block) expected-zeros)) 

  ;; 5. Тест Квантование
  (let ((dct-block (make-array '(8 8) :initial-element 100))
        (q-tbl     (make-array '(8 8) :initial-element 10))
        (expected  (make-array '(8 8) :initial-element 10)))
    (assert-equal "Quantization" 
                  (quantize-block dct-block q-tbl) 
                  expected))

  (let ((block (make-array '(8 8) :initial-element 0))
        (expected (make-array 64 :initial-element 0)))
    
    (setf (aref block 0 0) 10) 
    (setf (aref block 0 1) 20)  
    (setf (aref block 1 0) 30) 
    (setf (aref block 7 7) 99) 
    
    (setf (aref expected 0) 10)
    (setf (aref expected 1) 20)
    (setf (aref expected 2) 30)
    (setf (aref expected 63) 99)

    (assert-equal "ZigZag" (zigzag-scan block) expected))
    
  (format t "~%--- ТЕСТЫ ЗАВЕРШЕНЫ ---~%"))

(run-tests)


